[
  {
    "title": "Map 1",
    "topic": {
      "title": "Advanced Audit Policy",
      "topics": [
        {
          "title": "Account Logon",
          "topics": [
            {
              "title": "Audit Credential Validation",
              "note": "This policy setting allows you to audit events generated by validation tests on user account logon credentials.\n\nEvents in this subcategory occur only on the computer that is authoritative for those credentials. For domain accounts, the domain controller is authoritative. For local accounts, the local computer is authoritative.\n\nVolume: High on domain controllers.\n\nDefault on Client editions: No Auditing.\n\nDefault on Server editions: Success.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-red",
                "star-red",
                "flag-red"
              ],
              "topics": [
                {
                  "title": "4774",
                  "note": "An account was mapped for logon."
                },
                {
                  "title": "4775",
                  "note": "An account could not be mapped for logon."
                },
                {
                  "title": "4776",
                  "note": "The domain controller attempted to validate the credentials for an account."
                },
                {
                  "title": "4777",
                  "note": "The domain controller failed to validate the credentials for an account."
                }
              ]
            },
            {
              "title": "Audit Kerberos Authentication Service",
              "note": "This policy setting allows you to audit events generated by Kerberos authentication ticket-granting ticket (TGT) requests.\n\nIf you configure this policy setting, an audit event is generated after a Kerberos authentication TGT request. Success audits record successful requests and Failure audits record unsuccessful requests.\nIf you do not configure this policy setting, no audit event is generated after a Kerberos authentication TGT request.\n\nVolume: High on Kerberos Key Distribution Center servers.\n\nDefault on Client editions: No Auditing\n\nDefault on Server editions: Success.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-red",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4768",
                  "note": "A Kerberos authentication ticket (TGT) was requested."
                },
                {
                  "title": "4771",
                  "note": "Kerberos preauthentication failed."
                },
                {
                  "title": "4772",
                  "note": "A Kerberos authentication ticket request failed."
                }
              ]
            },
            {
              "title": "Audit Kerberos Service Ticket Operations",
              "note": "This policy setting allows you to audit events generated by Kerberos authentication ticket-granting ticket (TGT) requests submitted for user accounts.\n\nIf you configure this policy setting, an audit event is generated after a Kerberos authentication TGT is requested for a user account. Success audits record successful requests and Failure audits record unsuccessful requests.\nIf you do not configure this policy setting, no audit event is generated after a Kerberos authentication TGT is request for a user account.\n\nVolume: Low.\n\nDefault on Client editions: No Auditing.\n\nDefault on Server editions: Success.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4769",
                  "note": "A Kerberos service ticket was requested."
                },
                {
                  "title": "4770",
                  "note": "A Kerberos service ticket was renewed."
                },
                {
                  "title": "4773",
                  "note": "A Kerberos service ticket request failed."
                }
              ]
            },
            {
              "title": "Audit Other Account Logon Events",
              "note": "This policy setting allows you to audit events generated by responses to credential requests submitted for a user account logon that are not credential validation or Kerberos tickets.\n\nCurrently, there are no events in this subcategory.\n\nDefault: No Auditing.\n\nRecommended by the ANSSI.",
              "makers": [
                "star-red"
              ]
            }
          ]
        },
        {
          "title": "Account Management",
          "topics": [
            {
              "title": "Audit Application Group Management",
              "note": "This policy setting allows you to audit events generated by changes to application groups such as the following:\n\tApplication group is created, changed, or deleted.\n\tMember is added or removed from an application group.\n\nIf you configure this policy setting, an audit event is generated when an attempt to change an application group is made. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated when an application group changes.\n\nVolume: Low.\n\nDefault: No Auditing.",
              "makers": [
                "tag-green"
              ],
              "topics": [
                {
                  "title": "4783",
                  "note": "A basic application group was created."
                },
                {
                  "title": "4784",
                  "note": "A basic application group was created."
                },
                {
                  "title": "4785",
                  "note": "A member was added to a basic application group."
                },
                {
                  "title": "4786",
                  "note": "A member was removed from a basic application group."
                },
                {
                  "title": "4787",
                  "note": "A non-member was added to a basic application group."
                },
                {
                  "title": "4788",
                  "note": "A non-member was removed from a basic application group."
                },
                {
                  "title": "4789",
                  "note": "A basic application group was deleted."
                },
                {
                  "title": "4790",
                  "note": "An LDAP query group was created."
                },
                {
                  "title": "4791",
                  "note": "An LDAP query group was changed."
                },
                {
                  "title": "4792",
                  "note": "An LDAP query group was changed."
                }
              ]
            },
            {
              "title": "Audit Computer Account Management",
              "note": "This policy setting allows you to audit events generated by changes to computer accounts such as when a computer account is created, changed, or deleted.\n\nIf you configure this policy setting, an audit event is generated when an attempt to change a computer account is made. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated when a computer account changes.\n\nVolume: Low.\n\nDefault on Client editions: No Auditing.\n\nDefault on Server editions: Success.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4741",
                  "note": "A computer account was created."
                },
                {
                  "title": "4742",
                  "note": "A computer account was changed."
                },
                {
                  "title": "4743",
                  "note": "A computer account was deleted."
                }
              ]
            },
            {
              "title": "Audit Distribution Group Management",
              "note": "This policy setting allows you to audit events generated by changes to distribution groups such as the following:\n\tDistribution group is created, changed, or deleted.\n\tMember is added or removed from a distribution group.\n\tDistribution group type is changed.\n\nIf you configure this policy setting, an audit event is generated when an attempt to change a distribution group is made. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated when a distribution group changes.\n\nNote: Events in this subcategory are logged only on domain controllers.\n\nVolume: Low.\n\nDefault: No Auditing.",
              "makers": [
                "tag-green"
              ],
              "topics": [
                {
                  "title": "4744",
                  "note": "A security-disabled local group was created."
                },
                {
                  "title": "4745",
                  "note": "A member was added to a security-disabled local group."
                },
                {
                  "title": "4746",
                  "note": "A member was added to a security-disabled local group."
                },
                {
                  "title": "4747",
                  "note": "A member was removed from a security-disabled local group."
                },
                {
                  "title": "4748",
                  "note": "A security-disabled local group was deleted."
                },
                {
                  "title": "4749",
                  "note": "A security-disabled global group was created."
                },
                {
                  "title": "4750",
                  "note": "A security-disabled global group was changed."
                },
                {
                  "title": "4751",
                  "note": "A member was added to a security-disabled global group."
                },
                {
                  "title": "4752",
                  "note": "A member was removed from a security-disabled global group."
                },
                {
                  "title": "4753",
                  "note": "A security-disabled global group was deleted."
                },
                {
                  "title": "4759",
                  "note": "A security-disabled universal group was created."
                },
                {
                  "title": "4760",
                  "note": "A security-disabled universal group was changed."
                },
                {
                  "title": "4761",
                  "note": "A member was added to a security-disabled universal group."
                },
                {
                  "title": "4762",
                  "note": "A member was removed from a security-disabled universal group."
                },
                {
                  "title": "4763",
                  "note": "A security-disabled universal group was deleted."
                }
              ]
            },
            {
              "title": "Audit Other Account Management Events",
              "note": "This policy setting allows you to audit events generated by other user account changes that are not covered in this category, such as the following:\n\tThe password hash of a user account was accessed. This typically happens during an Active Directory Management Tool password migration.\n\tThe Password Policy Checking API was called. Calls to this function can be part of an attack when a malicious application tests the policy to reduce the number of attempts during a password dictionary attack.\n\tChanges to the Default Domain Group Policy under the following Group Policy paths:\nComputer Configuration\\Windows Settings\\Security Settings\\Account Policies\\Password Policy\nComputer Configuration\\Windows Settings\\Security Settings\\Account Policies\\Account Lockout Policy\n\nNote: The security audit event is logged when the policy setting is applied. It does not occur at the time when the settings are modified.\n\nVolume: Low.\n\nDefault: No Auditing.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4782",
                  "note": "The password hash for an account was accessed."
                },
                {
                  "title": "4793",
                  "note": "The Password Policy Checking API was called."
                }
              ]
            },
            {
              "title": "Audit Security Group Management",
              "note": "This policy setting allows you to audit events generated by changes to security groups such as the following:\n\tSecurity group is created, changed, or deleted.\n\tMember is added or removed from a security group.\n\tGroup type is changed.\n\nIf you configure this policy setting, an audit event is generated when an attempt to change a security group is made. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated when a security group changes.\n\nVolume: Low.\n\nDefault: Success.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4727",
                  "note": "A security-enabled global group was created."
                },
                {
                  "title": "4728",
                  "note": "A member was added to a security-enabled global group."
                },
                {
                  "title": "4729",
                  "note": "A member was removed from a security-enabled global group."
                },
                {
                  "title": "4730",
                  "note": "A security-enabled global group was deleted."
                },
                {
                  "title": "4731",
                  "note": "A security-enabled local group was created."
                },
                {
                  "title": "4732",
                  "note": "A member was added to a security-enabled local group."
                },
                {
                  "title": "4733",
                  "note": "A member was removed from a security-enabled local group."
                },
                {
                  "title": "4734",
                  "note": "A security-enabled local group was deleted."
                },
                {
                  "title": "4735",
                  "note": "A security-enabled local group was changed."
                },
                {
                  "title": "4737",
                  "note": "A security-enabled global group was changed."
                },
                {
                  "title": "4754",
                  "note": "A security-enabled universal group was created."
                },
                {
                  "title": "4755",
                  "note": "A security-enabled universal group was changed."
                },
                {
                  "title": "4756",
                  "note": "A member was added to a security-enabled universal group."
                },
                {
                  "title": "4757",
                  "note": "A member was removed from a security-enabled universal group."
                },
                {
                  "title": "4758",
                  "note": "A security-enabled universal group was deleted."
                },
                {
                  "title": "4764",
                  "note": "A group's type was changed."
                },
                {
                  "title": "4799",
                  "note": "A security-enabled local group membership was enumerated."
                }
              ]
            },
            {
              "title": "Audit User Account Management",
              "note": "This policy setting allows you to audit changes to user accounts. Events include the following:\n\tA user account is created, changed, deleted; renamed, disabled, enabled, locked out, or unlocked.\n\tA user account’s password is set or changed.\n\tA security identifier (SID) is added to the SID History of a user account.\n\tThe Directory Services Restore Mode password is configured.\n\tPermissions on administrative user accounts are changed.\n\tCredential Manager credentials are backed up or restored.\n\nIf you configure this policy setting, an audit event is generated when an attempt to change a user account is made. Success audits record successful attempts and Failure audits record unsuccessful attempts. If you do not configure this policy setting, no audit event is generated when a user account changes.\n\nVolume: Low.\n\nDefault: Success.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4720",
                  "note": "A user account was created."
                },
                {
                  "title": "4722",
                  "note": "A user account was enabled."
                },
                {
                  "title": "4723",
                  "note": "An attempt was made to change an account's password."
                },
                {
                  "title": "4724",
                  "note": "An attempt was made to reset an account's password."
                },
                {
                  "title": "4725",
                  "note": "A user account was disabled."
                },
                {
                  "title": "4726",
                  "note": "A user account was deleted."
                },
                {
                  "title": "4738",
                  "note": "A user account was changed."
                },
                {
                  "title": "4740",
                  "note": "A user account was locked out."
                },
                {
                  "title": "4765",
                  "note": "SID History was added to an account."
                },
                {
                  "title": "4766",
                  "note": "An attempt to add SID History to an account failed."
                },
                {
                  "title": "4767",
                  "note": "A user account was unlocked."
                },
                {
                  "title": "4780",
                  "note": "The ACL was set on accounts which are members of administrators groups."
                },
                {
                  "title": "4781",
                  "note": "The name of an account was changed."
                },
                {
                  "title": "4794",
                  "note": "An attempt was made to set the Directory Services Restore Mode."
                },
                {
                  "title": "4798",
                  "note": "A user's local group membership was enumerated."
                },
                {
                  "title": "5376",
                  "note": "Credential Manager credentials were backed up."
                },
                {
                  "title": "5377",
                  "note": "Credential Manager credentials were restored from a backup."
                }
              ]
            }
          ]
        },
        {
          "title": "Detailed Tracking",
          "topics": [
            {
              "title": "Audit DPAPI Activity",
              "note": "This policy setting allows you to audit events generated when encryption or decryption requests are made to the Data Protection application interface (DPAPI). DPAPI is used to protect secret information such as stored password and key information. For more information about DPAPI, see https://go.microsoft.com/fwlink/?LinkId=121720.\n\nIf you configure this policy setting, an audit event is generated when an encryption or decryption request is made to DPAPI. Success audits record successful requests and Failure audits record unsuccessful requests.\nIf you do not configure this policy setting, no audit event is generated when an encryption or decryption request is made to DPAPI.\n\nVolume: Low.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4692",
                  "note": "Backup of data protection master key was attempted."
                },
                {
                  "title": "4693",
                  "note": "Recovery of data protection master key was attempted."
                },
                {
                  "title": "4694",
                  "note": "Protection of auditable protected data was attempted."
                },
                {
                  "title": "4695",
                  "note": "Unprotection of auditable protected data was attempted."
                }
              ]
            },
            {
              "title": "Audit PNP Activity",
              "note": "This policy setting allows you to audit when plug and play detects an external device.\n\nIf you configure this policy setting, an audit event is generated whenever plug and play detects an external device. Only Success audits are recorded for this category.\nIf you do not configure this policy setting, no audit event is generated when an external device is detected by plug and play.\n\nVolume: Low\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-orange"
              ],
              "topics": [
                {
                  "title": "6416",
                  "note": "A new external device was recognized by the System."
                },
                {
                  "title": "6419",
                  "note": "A request was made to disable a device."
                },
                {
                  "title": "6420",
                  "note": "A device was disabled."
                },
                {
                  "title": "6421",
                  "note": "A request was made to enable a device."
                },
                {
                  "title": "6422",
                  "note": "A device was enabled."
                },
                {
                  "title": "6423",
                  "note": "The installation of this device is forbidden by system policy."
                },
                {
                  "title": "6424",
                  "note": "The installation of this device was allowed, after having previously been forbidden by policy."
                }
              ]
            },
            {
              "title": "Audit Process Creation",
              "note": "This policy setting allows you to audit events generated when a process is created or starts. The name of the application or user that created the process is also audited.\n\nIf you configure this policy setting, an audit event is generated when a process is created. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated when a process is created.\n\nVolume: Depends on how the computer is used.\n\nRecommended by the ANSSI.",
              "makers": [
                "symbol-question",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4688",
                  "note": "A new process has been created."
                },
                {
                  "title": "4696",
                  "note": "A primary token was assigned to a process."
                }
              ]
            },
            {
              "title": "Audit Process Termination",
              "note": "This policy setting allows you to audit events generated when a process ends. \n\nIf you configure this policy setting, an audit event is generated when a process ends. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated when a process ends.\n\nVolume: Depends on how the computer is used.",
              "makers": [
                "symbol-question"
              ],
              "topics": [
                {
                  "title": "4689",
                  "note": "A process has exited."
                }
              ]
            },
            {
              "title": "Audit RPC Events",
              "note": "This policy setting allows you to audit inbound remote procedure call (RPC) connections.\n\nIf you configure this policy setting, an audit event is generated when a remote RPC connection is attempted. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated when a remote RPC connection is attempted.\n\nVolume: High on RPC servers.",
              "makers": [
                "tag-red"
              ],
              "topics": [
                {
                  "title": "5712",
                  "note": "A Remote Procedure Call (RPC) was attempted."
                }
              ]
            },
            {
              "title": "Audit Token Right Adjusted",
              "note": "This policy setting allows you to audit events generated by adjusting the privileges of a token.\n\nVolume: High.\n\nDefault: No Auditing.",
              "makers": [
                "tag-red"
              ],
              "topics": [
                {
                  "title": "4703",
                  "note": "A user right was adjusted."
                }
              ]
            }
          ]
        },
        {
          "title": "DS Access",
          "topics": [
            {
              "title": "Audit Detailed Directory Service Replication",
              "note": "This policy setting allows you to audit events generated by detailed Active Directory Domain Services (AD DS) replication between domain controllers.\n\nVolume: High.\n\nDefault: No Auditing.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-red",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4928",
                  "note": "An Active Directory replica source naming context was established."
                },
                {
                  "title": "4929",
                  "note": "An Active Directory replica source naming context was removed."
                },
                {
                  "title": "4930",
                  "note": "An Active Directory replica source naming context was modified."
                },
                {
                  "title": "4931",
                  "note": "An Active Directory replica destination naming context was modified."
                },
                {
                  "title": "4934",
                  "note": "Attributes of an Active Directory object were replicated."
                },
                {
                  "title": "4935",
                  "note": "Replication failure begins."
                },
                {
                  "title": "4936",
                  "note": "Replication failure ends."
                },
                {
                  "title": "4937",
                  "note": "A lingering object was removed from a replica."
                }
              ]
            },
            {
              "title": "Audit Directory Service Access",
              "note": "This policy setting allows you to audit events generated when an Active Directory Domain Services (AD DS) object is accessed. \n\nOnly AD DS objects with a matching system access control list (SACL) are logged.\n\nEvents in this subcategory are similar to the Directory Service Access events available in previous versions of Windows.\n\nVolume: High on domain controllers. None on client computers.\n\nDefault on Client editions: No Auditing.\n\nDefault on Server editions: Success.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-red",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4662",
                  "note": "An operation was performed on an object."
                },
                {
                  "title": "4661",
                  "note": "A handle to an object was requested."
                }
              ]
            },
            {
              "title": "Audit Directory Service Changes",
              "note": "This policy setting allows you to audit events generated by changes to objects in Active Directory Domain Services (AD DS). Events are logged when an object is created, deleted, modified, moved, or undeleted.\n\nWhen possible, events logged in this subcategory indicate the old and new values of the object’s properties.\n\nEvents in this subcategory are logged only on domain controllers, and only objects in AD DS with a matching system access control list (SACL) are logged.\n\nNote: Actions on some objects and properties do not cause audit events to be generated due to settings on the object class in the schema.\n\nIf you configure this policy setting, an audit event is generated when an attempt to change an object in AD DS is made. Success audits record successful attempts, however unsuccessful attempts are NOT recorded.\nIf you do not configure this policy setting, no audit event is generated when an attempt to change an object in AD DS object is made.\n\nVolume: High on domain controllers only.\n\nDefault: No Auditing.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-red",
                "star-red"
              ],
              "topics": [
                {
                  "title": "5136",
                  "note": "A directory service object was modified."
                },
                {
                  "title": "5137",
                  "note": "A directory service object was created."
                },
                {
                  "title": "5138",
                  "note": "A directory service object was undeleted."
                },
                {
                  "title": "5139",
                  "note": "A directory service object was moved."
                },
                {
                  "title": "5141",
                  "note": "A directory service object was deleted."
                }
              ]
            },
            {
              "title": "Audit Directory Service Replication",
              "note": "This policy setting allows you to audit replication between two Active Directory Domain Services (AD DS) domain controllers.\n\nIf you configure this policy setting, an audit event is generated during AD DS replication. Success audits record successful replication and Failure audits record unsuccessful replication.\nIf you do not configure this policy setting, no audit event is generated during AD DS replication.\n\nNote: Events in this subcategory are logged only on domain controllers.\n\nVolume: Medium on domain controllers. None on client computers.\n\nDefault: No Auditing.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-orange",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4932",
                  "note": "Synchronization of a replica of an Active Directory naming context has begun."
                },
                {
                  "title": "4933",
                  "note": "Synchronization of a replica of an Active Directory naming context has ended."
                }
              ]
            }
          ]
        },
        {
          "title": "Logon/Logoff",
          "topics": [
            {
              "title": "Audit Account Lockout",
              "note": "This policy setting allows you to audit events generated by a failed attempt to log on to an account that is locked out.\n\nIf you configure this policy setting, an audit event is generated when an account cannot log on to a computer because the account is locked out. Success audits record successful attempts and Failure audits record unsuccessful attempts.\n\nLogon events are essential for understanding user activity and to detect potential attacks.\n\nVolume: Low.\n\nDefault: Success.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4625",
                  "note": "An account failed to log on."
                }
              ]
            },
            {
              "title": "Audit User / Device Claims",
              "note": "This policy allows you to audit user and device claims information in the user's logon token. Events in this subcategory are generated on the computer on which a logon session is created. For an interactive logon, the security audit event is generated on the computer that the user logged on to. For a network logon, such as accessing a shared folder on the network, the security audit event is generated on the computer hosting the resource.\n\nUser claims are added to a logon token when claims are included with a user's account attributes in Active Directory. Device claims are added to the logon token when claims are included with a device's computer account attributes in Active Directory. In addition, compound identity must be enabled for the domain and on the computer where the user logged on.\n\nWhen this setting is configured, one or more security audit events are generated for each successful logon. You must also enable the Audit Logon setting under Advanced Audit Policy Configuration\\System Audit Policies\\Logon/Logoff. Multiple events are generated if the user and device claims information cannot fit in a single security audit event.\n\nVolume: Low on a client computer. Medium on a domain controller or a network server\n\nDefault: No Auditing.",
              "makers": [
                "symbol-question"
              ],
              "topics": [
                {
                  "title": "4626",
                  "note": "User/Device claims information."
                }
              ]
            },
            {
              "title": "Audit Group Membership",
              "note": "This policy allows you to audit the group memberhsip information in the user's logon token. Events in this subcategory are generated on the computer on which a logon session is created. For an interactive logon, the security audit event is generated on the computer that the user logged on to. For a network logon, such as accessing a shared folder on the network, the security audit event is generated on the computer hosting the resource.\n\nWhen this setting is configured, one or more security audit events are generated for each successful logon. You must also enable the Audit Logon setting under Advanced Audit Policy Configuration\\System Audit Policies\\Logon/Logoff. Multiple events are generated if the group memberhsip information cannot fit in a single security audit event.\n\nVolume: Low on a client computer. Medium on a domain controller or a network server\n\nDefault: No Auditing.",
              "makers": [
                "symbol-question"
              ],
              "topics": [
                {
                  "title": "4627",
                  "note": "Group membership information."
                }
              ]
            },
            {
              "title": "Audit IPsec Extended Mode",
              "note": "This policy setting allows you to audit events generated by Internet Key Exchange protocol (IKE) and Authenticated Internet Protocol (AuthIP) during Extended Mode negotiations.\n\nIf you configure this policy setting, an audit event is generated during an IPsec Extended Mode negotiation. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated during an IPsec Extended Mode negotiation.\n\nVolume: High.\n\nDefault: No Auditing.",
              "makers": [
                "tag-red"
              ],
              "topics": [
                {
                  "title": "4978",
                  "note": "During Extended Mode negotiation, IPsec received an invalid negotiation packet. If this problem persists, it could indicate a network issue or an attempt to modify or replay this negotiation."
                },
                {
                  "title": "4979",
                  "note": "IPsec Main Mode and Extended Mode security associations were established."
                },
                {
                  "title": "4980",
                  "note": "IPsec Main Mode and Extended Mode security associations were established."
                },
                {
                  "title": "4981",
                  "note": "IPsec Main Mode and Extended Mode security associations were established."
                },
                {
                  "title": "4982",
                  "note": "IPsec Main Mode and Extended Mode security associations were established."
                },
                {
                  "title": "4983",
                  "note": "An IPsec Extended Mode negotiation failed. The corresponding Main Mode security association has been deleted."
                },
                {
                  "title": "4984",
                  "note": "An IPsec Extended Mode negotiation failed. The corresponding Main Mode security association has been deleted."
                }
              ]
            },
            {
              "title": "Audit IPsec Main Mode",
              "note": "This policy setting allows you to audit events generated by Internet Key Exchange protocol (IKE) and Authenticated Internet Protocol (AuthIP) during Main Mode negotiations.\n\nIf you configure this policy setting, an audit event is generated during an IPsec Main Mode negotiation. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated during an IPsec Main Mode negotiation.\n\nVolume: High.\n\nDefault: No Auditing.",
              "makers": [
                "tag-red"
              ],
              "topics": [
                {
                  "title": "4646",
                  "note": "IKE DoS-prevention mode started."
                },
                {
                  "title": "4650",
                  "note": "An IPsec Main Mode security association was established. Extended Mode was not enabled. Certificate authentication was not used."
                },
                {
                  "title": "4651",
                  "note": "An IPsec Main Mode security association was established. Extended Mode was not enabled. A certificate was used for authentication."
                },
                {
                  "title": "4652",
                  "note": "An IPsec Main Mode negotiation failed."
                },
                {
                  "title": "4653",
                  "note": "An IPsec Main Mode negotiation failed."
                },
                {
                  "title": "4655",
                  "note": "An IPsec Main Mode security association ended."
                },
                {
                  "title": "4976",
                  "note": "During Main Mode negotiation, IPsec received an invalid negotiation packet. If this problem persists, it could indicate a network issue or an attempt to modify or replay this negotiation."
                },
                {
                  "title": "5049",
                  "note": "An IPsec Security Association was deleted."
                },
                {
                  "title": "5453",
                  "note": "An IPsec negotiation with a remote computer failed because the IKE and AuthIP IPsec Keying Modules (IKEEXT) service is not started."
                }
              ]
            },
            {
              "title": "Audit IPsec Quick Mode",
              "note": "This policy setting allows you to audit events generated by Internet Key Exchange protocol (IKE) and Authenticated Internet Protocol (AuthIP) during Quick Mode negotiations.\n\nIf you configure this policy setting, an audit event is generated during an IPsec Quick Mode negotiation. Success audits record successful attempts and Failure audits record unsuccessful attempts.If\n you do not configure this policy setting, no audit event is generated during an IPsec Quick Mode negotiation.\n\nVolume: High.\n\nDefault: No Auditing.",
              "makers": [
                "tag-red"
              ],
              "topics": [
                {
                  "title": "4977",
                  "note": "During Quick Mode negotiation, IPsec received an invalid negotiation packet. If this problem persists, it could indicate a network issue or an attempt to modify or replay this negotiation."
                },
                {
                  "title": "5451",
                  "note": "An IPsec Quick Mode security association was established."
                },
                {
                  "title": "5452",
                  "note": "An IPsec Quick Mode security association ended."
                }
              ]
            },
            {
              "title": "Audit Logoff",
              "note": "This policy setting allows you to audit events generated by the closing of a logon session. These events occur on the computer that was accessed. For an interactive logoff the security audit event is generated on the computer that the user account logged on to.\n\nIf you configure this policy setting, an audit event is generated when a logon session is closed. Success audits record successful attempts to close sessions and Failure audits record unsuccessful attempts to close sessions.\nIf you do not configure this policy setting, no audit event is generated when a logon session is closed.\n\nVolume: Low.\n\nDefault: Success.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-orange"
              ],
              "topics": [
                {
                  "title": "4634",
                  "note": "An account was logged off."
                },
                {
                  "title": "4647",
                  "note": "User initiated logoff."
                }
              ]
            },
            {
              "title": "Audit Logon",
              "note": "This policy setting allows you to audit events generated by user account logon attempts on the computer.\nEvents in this subcategory are related to the creation of logon sessions and occur on the computer which was accessed. For an interactive logon, the security audit event is generated on the computer that the user account logged on to. For a network logon, such as accessing a shared folder on the network, the security audit event is generated on the computer hosting the resource. The following events are included:\n\tSuccessful logon attempts.\n\tFailed logon attempts.\n\tLogon attempts using explicit credentials. This event is generated when a process attempts to log on an account by explicitly specifying that account’s credentials. This most commonly occurs in batch logon configurations, such as scheduled tasks or when using the RUNAS command.\n\tSecurity identifiers (SIDs) were filtered and not allowed to log on.\n\nVolume: Low on a client computer. Medium on a domain controller or a network server\n\nDefault on Client editions: Success.\n\nDefault on Server editions: Success, Failure.\n\nRecommended by the ANSSI.",
              "makers": [
                "symbol-question",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4624",
                  "note": "An account was successfully logged on."
                },
                {
                  "title": "4625",
                  "note": "An account failed to log on."
                },
                {
                  "title": "4648",
                  "note": "A logon was attempted using explicit credentials."
                },
                {
                  "title": "4675",
                  "note": "SIDs were filtered."
                }
              ]
            },
            {
              "title": "Audit Network Policy Server",
              "note": "This policy setting allows you to audit events generated by RADIUS (IAS) and Network Access Protection (NAP) user access requests. These requests can be Grant, Deny, Discard, Quarantine, Lock, and Unlock.\nIf you configure this policy setting, an audit event is generated for each IAS and NAP user access request. Success audits record successful user access requests and Failure audits record unsuccessful attempts.\nIf you do not configure this policy settings, IAS and NAP user access requests are not audited.\n\nVolume: Medium or High on NPS and IAS server. No volume on other computers.\n\nDefault: Success, Failure.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-red",
                "star-red"
              ],
              "topics": [
                {
                  "title": "6272",
                  "note": "Network Policy Server granted access to a user."
                },
                {
                  "title": "6273",
                  "note": "Network Policy Server denied access to a user."
                },
                {
                  "title": "6274",
                  "note": "Network Policy Server discarded the request for a user."
                },
                {
                  "title": "6275",
                  "note": "Network Policy Server discarded the accounting request for a user."
                },
                {
                  "title": "6276",
                  "note": "Network Policy Server quarantined a user."
                },
                {
                  "title": "6277",
                  "note": "Network Policy Server granted access to a user but put it on probation because the host did not meet the defined health policy."
                },
                {
                  "title": "6278",
                  "note": "Network Policy Server granted full access to a user because the host met the defined health policy."
                },
                {
                  "title": "6279",
                  "note": "Network Policy Server locked the user account due to repeated failed authentication attempts."
                },
                {
                  "title": "6280",
                  "note": "Network Policy Server unlocked the user account."
                }
              ]
            },
            {
              "title": "Audit Other Logon/Logoff Events",
              "note": "This policy setting allows you to audit other logon/logoff-related events that are not covered in the “Logon/Logoff” policy setting such as the following:\n\tTerminal Services session disconnections.\n\tNew Terminal Services sessions.\n\tLocking and unlocking a workstation.\n\tInvoking a screen saver.\n\tDismissal of a screen saver.\n\tDetection of a Kerberos replay attack, in which a Kerberos request was received twice with identical information. This condition could be caused by network misconfiguration.\n\tAccess to a wireless network granted to a user or computer account.\n\tAccess to a wired 802.1x network granted to a user or computer account.\n\nVolume: Low.\n\nDefault: No Auditing.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4649",
                  "note": "A replay attack was detected."
                },
                {
                  "title": "4778",
                  "note": "A session was reconnected to a Window Station."
                },
                {
                  "title": "4779",
                  "note": "A session was disconnected from a Window Station."
                },
                {
                  "title": "4800",
                  "note": "The workstation was locked."
                },
                {
                  "title": "4801",
                  "note": "The workstation was unlocked."
                },
                {
                  "title": "4802",
                  "note": "The screen saver was invoked."
                },
                {
                  "title": "4803",
                  "note": "The screen saver was dismissed."
                },
                {
                  "title": "5378",
                  "note": "The requested credentials delegation was disallowed by policy."
                },
                {
                  "title": "5632",
                  "note": "A request was made to authenticate to a wireless network."
                },
                {
                  "title": "5633",
                  "note": "A request was made to authenticate to a wired network."
                }
              ]
            },
            {
              "title": "Audit Special Logon",
              "note": "This policy setting allows you to audit events generated by special logons such as the following :\n\tThe use of a special logon, which is a logon that has administrator-equivalent privileges and can be used to elevate a process to a higher level.\n\tA logon by a member of a Special Group. Special Groups enable you to audit events generated when a member of a certain group has logged on to your network. You can configure a list of group security identifiers (SIDs) in the registry. If any of those SIDs are added to a token during logon and the subcategory is enabled, an event is logged. For more information about this feature, see article 947223 in the Microsoft Knowledge Base (https://go.microsoft.com/fwlink/?LinkId=121697). \n\nVolume: Low.\n\nDefault: Success.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-orange"
              ],
              "topics": [
                {
                  "title": "4964",
                  "note": "Special groups have been assigned to a new logon."
                },
                {
                  "title": "4672",
                  "note": "Special privileges assigned to new logon."
                }
              ]
            }
          ]
        },
        {
          "title": "Object Access",
          "topics": [
            {
              "title": "Audit Application Generated",
              "note": "This policy setting allows you to audit applications that generate events using the Windows Auditing application programming interfaces (APIs). Applications designed to use the Windows Auditing API use this subcategory to log auditing events related to their function.\nEvents in this subcategory include:\n\tCreation of an application client context.\n\tDeletion of an application client context.\n\tInitialization of an application client context.\n\tOther application operations using the Windows Auditing APIs.\n\nVolume: Depends on the applications that are generating them.",
              "makers": [
                "symbol-question"
              ],
              "topics": [
                {
                  "title": "4665",
                  "note": "An attempt was made to create an application client context."
                },
                {
                  "title": "4666",
                  "note": "An application attempted an operation."
                },
                {
                  "title": "4667",
                  "note": "An application client context was deleted."
                },
                {
                  "title": "4668",
                  "note": "An application was initialized."
                }
              ]
            },
            {
              "title": "Audit Certification Services",
              "note": "This policy setting allows you to audit Active Directory Certificate Services (AD CS) operations.\nAD CS operations include the following:\n\tAD CS startup/shutdown/backup/restore.\n\tChanges to the certificate revocation list (CRL).\n\tNew certificate requests.\n\tIssuing of a certificate.\n\tRevocation of a certificate.\n\tChanges to the Certificate Manager settings for AD CS.\n\tChanges in the configuration of AD CS.\n\tChanges to a Certificate Services template.\n\tImporting of a certificate.\n\tPublishing of a certification authority certificate is to Active Directory Domain Services.\n\tChanges to the security permissions for AD CS.\n\tArchival of a key.\n\tImporting of a key.\n\tRetrieval of a key.\n\tStarting of Online Certificate Status Protocol (OCSP) Responder Service.\n\tStopping of Online Certificate Status Protocol (OCSP) Responder Service.\n\nVolume: Medium or Low on computers running Active Directory Certificate Services.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-orange",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4868",
                  "note": "The certificate manager denied a pending certificate request."
                },
                {
                  "title": "4869",
                  "note": "Certificate Services received a resubmitted certificate request."
                },
                {
                  "title": "4870",
                  "note": "Certificate Services revoked a certificate."
                },
                {
                  "title": "4871",
                  "note": "Certificate Services received a request to publish the certificate revocation list (CRL)."
                },
                {
                  "title": "4872",
                  "note": "Certificate Services published the certificate revocation list (CRL)."
                },
                {
                  "title": "4873",
                  "note": "A certificate request extension changed."
                },
                {
                  "title": "4874",
                  "note": "One or more certificate request attributes changed."
                },
                {
                  "title": "4875",
                  "note": "Certificate Services received a request to shut down."
                },
                {
                  "title": "4876",
                  "note": "Certificate Services backup started."
                },
                {
                  "title": "4877",
                  "note": "Certificate Services backup completed."
                },
                {
                  "title": "4878",
                  "note": "Certificate Services restore started."
                },
                {
                  "title": "4879",
                  "note": "Certificate Services restore completed."
                },
                {
                  "title": "4880",
                  "note": "Certificate Services started."
                },
                {
                  "title": "4881",
                  "note": "Certificate Services stopped."
                },
                {
                  "title": "4882",
                  "note": "The security permissions for Certificate Services changed."
                },
                {
                  "title": "4883",
                  "note": "Certificate Services retrieved an archived key."
                },
                {
                  "title": "4884",
                  "note": "Certificate Services imported a certificate into its database."
                },
                {
                  "title": "4885",
                  "note": "The audit filter for Certificate Services changed."
                },
                {
                  "title": "4886",
                  "note": "Certificate Services received a certificate request."
                },
                {
                  "title": "4887",
                  "note": "Certificate Services approved a certificate request and issued a certificate."
                },
                {
                  "title": "4888",
                  "note": "Certificate Services denied a certificate request."
                },
                {
                  "title": "4889",
                  "note": "Certificate Services set the status of a certificate request to pending."
                },
                {
                  "title": "4890",
                  "note": "The certificate manager settings for Certificate Services changed."
                },
                {
                  "title": "4891",
                  "note": "A configuration entry changed in Certificate Services."
                },
                {
                  "title": "4892",
                  "note": "A property of Certificate Services changed."
                },
                {
                  "title": "4893",
                  "note": "Certificate Services archived a key."
                },
                {
                  "title": "4894",
                  "note": "Certificate Services imported and archived a key."
                },
                {
                  "title": "4895",
                  "note": "Certificate Services published the CA certificate to Active Directory Domain Services."
                },
                {
                  "title": "4896",
                  "note": "One or more rows have been deleted from the certificate database."
                },
                {
                  "title": "4897",
                  "note": "Role separation enabled."
                },
                {
                  "title": "4898",
                  "note": "Certificate Services loaded a template."
                }
              ]
            },
            {
              "title": "Audit Detailed File Share",
              "note": "This policy setting allows you to audit attempts to access files and folders on a shared folder. The Detailed File Share setting logs an event every time a file or folder is accessed, whereas the File Share setting only records one event for any connection established between a client and file share.  Detailed File Share audit events include detailed information about the permissions or other criteria used to grant or deny access.\n\nIf you configure this policy setting, an audit event is generated when an attempt is made to access a file or folder on a share. The administrator can specify whether to audit only successes, only failures, or both successes and failures.\n\nNote: There are no system access control lists (SACLs) for shared folders. If this policy setting is enabled, access to all shared files and folders on the system is audited.\n\nVolume: High on a file server or domain controller because of SYSVOL network access required by Group Policy.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-red",
                "star-orange"
              ],
              "topics": [
                {
                  "title": "5145",
                  "note": "A network share object was checked to see whether the client can be granted desired access."
                }
              ]
            },
            {
              "title": "Audit File Share",
              "note": "This policy setting allows you to audit attempts to access a shared folder.\n\nIf you configure this policy setting, an audit event is generated when an attempt is made to access a shared folder. If this policy setting is defined, the administrator can specify whether to audit only successes, only failures, or both successes and failures.\n\nNote: There are no system access control lists (SACLs) for shared folders. If this policy setting is enabled, access to all shared folders on the system is audited.\n\nVolume: High on a file server or domain controller because of SYSVOL network access required by Group Policy.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-red",
                "star-red"
              ],
              "topics": [
                {
                  "title": "5140",
                  "note": "A network share object was accessed."
                },
                {
                  "title": "5142",
                  "note": "A network share object was added."
                },
                {
                  "title": "5143",
                  "note": "A network share object was modified."
                },
                {
                  "title": "5144",
                  "note": "A network share object was deleted."
                },
                {
                  "title": "5168",
                  "note": "SPN check for SMB/SMB2 failed."
                }
              ]
            },
            {
              "title": "Audit File System",
              "note": "This policy setting allows you to audit user attempts to access file system objects. A security audit event is generated only for objects that have system access control lists (SACL) specified, and only if the type of access requested, such as Write, Read, or Modify and the account making the request match the settings in the SACL. For more information about enabling object access auditing, see https://go.microsoft.com/fwlink/?LinkId=122083.\n\nIf you configure this policy setting, an audit event is generated each time an account accesses a file system object with a matching SACL. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated when an account accesses a file system object with a matching SACL.\n\nNote: You can set a SACL on a file system object using the Security tab in that object's Properties dialog box.\n\nVolume: Depends on how the file system SACLs are configured.\n\nRecommended by the ANSSI.",
              "makers": [
                "symbol-question",
                "star-green"
              ],
              "topics": [
                {
                  "title": "4664",
                  "note": "An attempt was made to create a hard link."
                },
                {
                  "title": "4985",
                  "note": "The state of a transaction has changed."
                },
                {
                  "title": "5051",
                  "note": "A file was virtualized."
                },
                {
                  "title": "4656",
                  "note": "A handle to an object was requested."
                },
                {
                  "title": "4658",
                  "note": "The handle to an object was closed."
                },
                {
                  "title": "4660",
                  "note": "An object was deleted."
                },
                {
                  "title": "4663",
                  "note": "An attempt was made to access an object."
                },
                {
                  "title": "4670",
                  "note": "Permissions on an object were changed."
                }
              ]
            },
            {
              "title": "Audit Filtering Platform Connection",
              "note": "This policy setting allows you to audit connections that are allowed or blocked by the Windows Filtering Platform (WFP). The following events are included:\n\tThe Windows Firewall Service blocks an application from accepting incoming connections on the network.\n\tThe WFP allows a connection.\n\tThe WFP blocks a connection.\n\tThe WFP permits a bind to a local port.\n\tThe WFP blocks a bind to a local port.\n\tThe WFP allows a connection.\n\tThe WFP blocks a connection.\n\tThe WFP permits an application or service to listen on a port for incoming connections.\n\tThe WFP blocks an application or service to listen on a port for incoming connections.\n\nIf you configure this policy setting, an audit event is generated when connections are allowed or blocked by the WFP. Success audits record events generated when connections are allowed and Failure audits record events generated when connections are blocked.\nIf you do not configure this policy setting, no audit event is generated when connected are allowed or blocked by the WFP.\n\nVolume: High.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-red",
                "star-green"
              ],
              "topics": [
                {
                  "title": "5031",
                  "note": "The Windows Firewall Service blocked an application from accepting incoming connections on the network."
                },
                {
                  "title": "5150",
                  "note": "The Windows Filtering Platform blocked a packet."
                },
                {
                  "title": "5151",
                  "note": "A more restrictive Windows Filtering Platform filter has blocked a packet."
                },
                {
                  "title": "5154",
                  "note": "The Windows Filtering Platform has permitted an application or service to listen on a port for incoming connections."
                },
                {
                  "title": "5155",
                  "note": "The Windows Filtering Platform has blocked an application or service from listening on a port for incoming connections."
                },
                {
                  "title": "5156",
                  "note": "The Windows Filtering Platform has allowed a connection."
                },
                {
                  "title": "5157",
                  "note": "The Windows Filtering Platform has blocked a connection."
                },
                {
                  "title": "5158",
                  "note": "The Windows Filtering Platform has permitted a bind to a local port."
                },
                {
                  "title": "5159",
                  "note": "The Windows Filtering Platform has blocked a bind to a local port."
                }
              ]
            },
            {
              "title": "Audit Filtering Platform Packet Drop",
              "note": "This policy setting allows you to audit packets that are dropped by Windows Filtering Platform (WFP).\n\nVolume: High.",
              "makers": [
                "tag-red"
              ],
              "topics": [
                {
                  "title": "5152",
                  "note": "The Windows Filtering Platform blocked a packet."
                },
                {
                  "title": "5153",
                  "note": "A more restrictive Windows Filtering Platform filter has blocked a packet."
                }
              ]
            },
            {
              "title": "Audit Handle Manipulation",
              "note": "This policy setting allows you to audit events generated when a handle to an object is opened or closed. Only objects with a matching system access control list (SACL) generate security audit events.\n\nIf you configure this policy setting, an audit event is generated when a handle is manipulated. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated when a handle is manipulated.\n\nNote: Events in this subcategory generate events only for object types where the corresponding Object Access subcategory is enabled. For example, if File system object access is enabled, handle manipulation security audit events are generated. If Registry object access is not enabled, handle manipulation security audit events will not be generated.\n\nVolume: Depends on how SACLs are configured.",
              "makers": [
                "symbol-question"
              ],
              "topics": [
                {
                  "title": "4658",
                  "note": "The handle to an object was closed."
                },
                {
                  "title": "4690",
                  "note": "An attempt was made to duplicate a handle to an object."
                }
              ]
            },
            {
              "title": "Audit Kernel Object",
              "note": "This policy setting allows you to audit attempts to access the kernel, which include mutexes and semaphores. \nOnly kernel objects with a matching system access control list (SACL) generate security audit events.\n\nNote: The Audit: Audit the access of global system objects policy setting controls the default SACL of kernel objects.\n\nVolume: High if auditing access of global system objects is enabled.",
              "makers": [
                "symbol-question"
              ],
              "topics": [
                {
                  "title": "4656",
                  "note": "A handle to an object was requested."
                },
                {
                  "title": "4658",
                  "note": "The handle to an object was closed."
                },
                {
                  "title": "4660",
                  "note": "An object was deleted."
                },
                {
                  "title": "4663",
                  "note": "An attempt was made to access an object."
                }
              ]
            },
            {
              "title": "Audit Other Object Access Events",
              "note": "This policy setting allows you to audit events generated by the management of task scheduler jobs or COM+ objects. \nFor scheduler jobs, the following are audited:\n\tJob created.\n\tJob deleted.\n\tJob enabled.\n\tJob disabled.\n\tJob updated.\nFor COM+ objects, the following are audited:\n\tCatalog object added.\n\tCatalog object updated.\n\tCatalog object deleted.\n\nVolume: Low.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4671",
                  "note": "An application attempted to access a blocked ordinal through the TBS."
                },
                {
                  "title": "4691",
                  "note": "Indirect access to an object was requested."
                },
                {
                  "title": "4698",
                  "note": "A scheduled task was created."
                },
                {
                  "title": "4699",
                  "note": "A scheduled task was deleted."
                },
                {
                  "title": "4700",
                  "note": "A scheduled task was enabled."
                },
                {
                  "title": "4701",
                  "note": "A scheduled task was disabled."
                },
                {
                  "title": "4702",
                  "note": "A scheduled task was updated."
                },
                {
                  "title": "5148",
                  "note": "The Windows Filtering Platform has detected a DoS attack and entered a defensive mode; packets associated with this attack will be discarded.\n\nThis event is logged only on computers running the supported versions of the Windows operating system."
                },
                {
                  "title": "5149",
                  "note": "The DoS attack has subsided and normal processing is being resumed.\n\nThis event is logged only on computers running the supported versions of the Windows operating system."
                },
                {
                  "title": "5888",
                  "note": "An object in the COM+ Catalog was modified."
                },
                {
                  "title": "5889",
                  "note": "An object was deleted from the COM+ Catalog."
                },
                {
                  "title": "5890",
                  "note": "An object was added to the COM+ Catalog."
                }
              ]
            },
            {
              "title": "Audit Registry",
              "note": "This policy setting allows you to audit attempts to access registry objects. A security audit event is generated only for objects that have system access control lists (SACLs) specified, and only if the type of access requested, such as Read, Write, or Modify, and the account making the request match the settings in the SACL.\n\nIf you configure this policy setting, an audit event is generated each time an account accesses a registry object with a matching SACL. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated when an account accesses a registry object with a matching SACL.\n\nNote: You can set a SACL on a registry object using the Permissions dialog box.\n\nVolume: Depends on how registry SACLs are configured.",
              "makers": [
                "symbol-question"
              ],
              "topics": [
                {
                  "title": "4663",
                  "note": "An attempt was made to access an object."
                },
                {
                  "title": "4656",
                  "note": "A handle to an object was requested."
                },
                {
                  "title": "4658",
                  "note": "The handle to an object was closed."
                },
                {
                  "title": "4660",
                  "note": "An object was deleted."
                },
                {
                  "title": "4657",
                  "note": "A registry value was modified."
                },
                {
                  "title": "5039",
                  "note": "A registry key was virtualized."
                },
                {
                  "title": "4670",
                  "note": "Permissions on an object were changed."
                }
              ]
            },
            {
              "title": "Audit Removable Storage",
              "note": "This policy setting allows you to audit user attempts to access file system objects on a removable storage device. A security audit event is generated only for all objects for all types of access requested.\n\nIf you configure this policy setting, an audit event is generated each time an account accesses a file system object on a removable storage. Success audits record successful attempts and Failure audits record unsuccessful attempts.\n\nIf you do not configure this policy setting, no audit event is generated when an account accesses a file system object on a removable storage.\n\nRecommended by the ANSSI.",
              "makers": [
                "symbol-question",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4656",
                  "note": "A handle to an object was requested."
                },
                {
                  "title": "4658",
                  "note": "The handle to an object was closed."
                },
                {
                  "title": "4663",
                  "note": "An attempt was made to access an object."
                }
              ]
            },
            {
              "title": "Audit SAM",
              "note": "This policy setting allows you to audit events generated by attempts to access to Security Accounts Manager (SAM) objects.\nSAM objects include the following:\n\tSAM_ALIAS -- A local group.\n\tSAM_GROUP -- A group that is not a local group.\n\tSAM_USER – A user account.\n\tSAM_DOMAIN – A domain.\n\tSAM_SERVER – A computer account.\nIf you configure this policy setting, an audit event is generated when an attempt to access a kernel object is made. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated when an attempt to access a kernel object is made.\nNote: Only the System Access Control List (SACL) for SAM_SERVER can be modified.\nVolume: High on domain controllers.",
              "makers": [
                "symbol-question"
              ],
              "topics": [
                {
                  "title": "4661",
                  "note": "A handle to an object was requested."
                }
              ]
            },
            {
              "title": "Audit Central Access Policy Staging",
              "note": "This policy setting allows you to audit access requests where the permission granted or denied by a proposed policy differs from the current central access policy on an object.\n\nIf you configure this policy setting, an audit event is generated each time a user accesses an object and the permission granted by the current central access policy on the object differs from that granted by the proposed policy. The resulting audit event will be generated as follows:\n1) Success audits, when configured, records access attempts when the current central access policy grants access but the proposed policy denies access.\n2) Failure audits when configured records access attempts when:\n   a) The current central access policy does not grant access but the proposed policy grants access.\n   b) A principal requests the maximum access rights they are allowed and the access rights granted by the current central access policy are different than the access rights granted by the proposed policy.\n\nVolume: Potentially high on a file server when the proposed policy differs significantly from the current central access policy.\n\nDefault: No Auditing",
              "makers": [
                "symbol-question"
              ],
              "topics": [
                {
                  "title": "4818",
                  "note": "Proposed Central Access Policy does not grant the same access permissions as the current Central Access Policy."
                }
              ]
            }
          ]
        },
        {
          "title": "Policy Change",
          "topics": [
            {
              "title": "Audit Audit Policy Change",
              "note": "This policy setting allows you to audit changes in the security audit policy settings such as the following:\n\tSettings permissions and audit settings on the Audit Policy object.\n\tChanges to the system audit policy.\n\tRegistration of security event sources.\n\tDe-registration of security event sources.\n\tChanges to the per-user audit settings.\n\tChanges to the value of CrashOnAuditFail.\n\tChanges to the system access control list on a file system or registry object.\n\tChanges to the Special Groups list.\n\nNote: System access control list (SACL) change auditing is done when a SACL for an object changes and the policy change category is enabled. Discretionary access control list (DACL) and ownership changes are audited when object access auditing is enabled and the object's SACL is configured for auditing of DACL/Owner change.\n\nVolume: Low.\n\nDefault: Success.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4715",
                  "note": "The audit policy (SACL) on an object was changed."
                },
                {
                  "title": "4719",
                  "note": "System audit policy was changed."
                },
                {
                  "title": "4817",
                  "note": "Auditing settings on an object were changed.\n\nThis event is logged only on computers running the supported versions of the Windows operating system."
                },
                {
                  "title": "4902",
                  "note": "The Per-user audit policy table was created."
                },
                {
                  "title": "4904",
                  "note": "An attempt was made to register a security event source."
                },
                {
                  "title": "4905",
                  "note": "An attempt was made to unregister a security event source."
                },
                {
                  "title": "4906",
                  "note": "The CrashOnAuditFail value has changed."
                },
                {
                  "title": "4907",
                  "note": "Auditing settings on object were changed."
                },
                {
                  "title": "4908",
                  "note": "Special Groups Logon table modified."
                },
                {
                  "title": "4912",
                  "note": "Per User Audit Policy was changed."
                }
              ]
            },
            {
              "title": "Audit Authentication Policy Change",
              "note": "This policy setting allows you to audit events generated by changes to the authentication policy such as the following:\n\tCreation of forest and domain trusts.\n\tModification of forest and domain trusts.\n\tRemoval of forest and domain trusts.\n\tChanges to Kerberos policy under Computer Configuration\\Windows Settings\\Security Settings\\Account Policies\\Kerberos Policy.\n\tGranting of any of the following user rights to a user or group:\n\t\tAccess This Computer From the Network.\n\t\tAllow Logon Locally.\n\t\tAllow Logon Through Terminal Services.\n\t\tLogon as a Batch Job.\n\t\tLogon a Service.\n\tNamespace collision. For example, when a new trust has the same name as an existing namespace name.\n\nIf you configure this policy setting, an audit event is generated when an attempt to change the authentication policy is made. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated when the authentication policy is changed.\n\nNote: The security audit event is logged when the group policy is applied. It does not occur at the time when the settings are modified.\n\nVolume: Low.\n\nDefault: Success.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4670",
                  "note": "Permissions on an object were changed"
                },
                {
                  "title": "4706",
                  "note": "A new trust was created to a domain."
                },
                {
                  "title": "4707",
                  "note": "A trust to a domain was removed."
                },
                {
                  "title": "4716",
                  "note": "Trusted domain information was modified."
                },
                {
                  "title": "4713",
                  "note": "Kerberos policy was changed."
                },
                {
                  "title": "4717",
                  "note": "System security access was granted to an account."
                },
                {
                  "title": "4718",
                  "note": "System security access was removed from an account."
                },
                {
                  "title": "4739",
                  "note": "Domain Policy was changed."
                },
                {
                  "title": "4864",
                  "note": "A namespace collision was detected."
                },
                {
                  "title": "4865",
                  "note": "A trusted forest information entry was added."
                },
                {
                  "title": "4866",
                  "note": "A trusted forest information entry was removed."
                },
                {
                  "title": "4867",
                  "note": "A trusted forest information entry was modified."
                }
              ]
            },
            {
              "title": "Audit Authorization Policy Change",
              "note": "This policy setting allows you to audit events generated by changes to the authorization policy such as the following:\n\tAssignment of user rights (privileges), such as SeCreateTokenPrivilege, that are not audited through the “Authentication Policy Change” subcategory.\n\tRemoval of user rights (privileges), such as SeCreateTokenPrivilege, that are not audited through the “Authentication Policy Change” subcategory.\n\tChanges in the Encrypted File System (EFS) policy.\n\tChanges to the Resource attributes of an object.\n\tChanges to the Central Access Policy (CAP) applied to an object.\n\nIf you configure this policy setting, an audit event is generated when an attempt to change the authorization policy is made. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated when the authorization policy changes.\n\nVolume: Low.\n\nDefault: No Auditing.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4703",
                  "note": "A user right was adjusted."
                },
                {
                  "title": "4704",
                  "note": "A user right was assigned."
                },
                {
                  "title": "4705",
                  "note": "A user right was removed."
                },
                {
                  "title": "4670",
                  "note": "Permissions on an object were changed."
                },
                {
                  "title": "4911",
                  "note": "Resource attributes of the object were changed."
                },
                {
                  "title": "4913",
                  "note": "Central Access Policy on the object was changed."
                }
              ]
            },
            {
              "title": "Audit Filtering Platform Policy Change",
              "note": "This policy setting allows you to audit events generated by changes to the Windows Filtering Platform (WFP) such as the following: \n\tIPsec services status.\n\tChanges to IPsec policy settings.\n\tChanges to Windows Firewall policy settings.\n\tChanges to WFP providers and engine.\n\nIf you configure this policy setting, an audit event is generated when a change to the WFP is attempted. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated when a change occurs to the WFP.\n\nVolume: Low.\n\nDefault: No Auditing.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4709",
                  "note": "IPsec Services was started."
                },
                {
                  "title": "4710",
                  "note": "IPsec Services was disabled."
                },
                {
                  "title": "4711",
                  "note": "May contain any one of the following:\nPAStore Engine applied locally cached copy of Active Directory storage IPsec policy on the computer.\nPAStore Engine applied Active Directory storage IPsec policy on the computer.\nPAStore Engine applied local registry storage IPsec policy on the computer.\nPAStore Engine failed to apply locally cached copy of Active Directory storage IPsec policy on the computer.\nPAStore Engine failed to apply Active Directory storage IPsec policy on the computer.\nPAStore Engine failed to apply local registry storage IPsec policy on the computer.\nPAStore Engine failed to apply some rules of the active IPsec policy on the computer.\nPAStore Engine failed to load directory storage IPsec policy on the computer.\nPAStore Engine loaded directory storage IPsec policy on the computer.\nPAStore Engine failed to load local storage IPsec policy on the computer.\nPAStore Engine loaded local storage IPsec policy on the computer.\nPAStore Engine polled for changes to the active IPsec policy and detected no changes."
                },
                {
                  "title": "4712",
                  "note": "IPsec Services encountered a potentially serious failure."
                },
                {
                  "title": "5040",
                  "note": "A change has been made to IPsec settings. An Authentication Set was added."
                },
                {
                  "title": "5041",
                  "note": "A change has been made to IPsec settings. An Authentication Set was modified."
                },
                {
                  "title": "5042",
                  "note": "A change has been made to IPsec settings. An Authentication Set was deleted."
                },
                {
                  "title": "5043",
                  "note": "A change has been made to IPsec settings. A Connection Security Rule was added."
                },
                {
                  "title": "5044",
                  "note": "A change has been made to IPsec settings. A Connection Security Rule was modified."
                },
                {
                  "title": "5045",
                  "note": "A change has been made to IPsec settings. A Connection Security Rule was deleted."
                },
                {
                  "title": "5046",
                  "note": "A change has been made to IPsec settings. A Crypto Set was added."
                },
                {
                  "title": "5047",
                  "note": "A change has been made to IPsec settings. A Crypto Set was modified."
                },
                {
                  "title": "5048",
                  "note": "A change has been made to IPsec settings. A Crypto Set was deleted."
                },
                {
                  "title": "5440",
                  "note": "The following callout was present when the Windows Filtering Platform Base Filtering Engine started."
                },
                {
                  "title": "5441",
                  "note": "The following filter was present when the Windows Filtering Platform Base Filtering Engine started."
                },
                {
                  "title": "5442",
                  "note": "The following provider was present when the Windows Filtering Platform Base Filtering Engine started."
                },
                {
                  "title": "5443",
                  "note": "The following provider context was present when the Windows Filtering Platform Base Filtering Engine started."
                },
                {
                  "title": "5444",
                  "note": "The following sub-layer was present when the Windows Filtering Platform Base Filtering Engine started."
                },
                {
                  "title": "5446",
                  "note": "A Windows Filtering Platform callout has been changed."
                },
                {
                  "title": "5448",
                  "note": "A Windows Filtering Platform provider has been changed."
                },
                {
                  "title": "5449",
                  "note": "A Windows Filtering Platform provider context has been changed."
                },
                {
                  "title": "5450",
                  "note": "A Windows Filtering Platform sub-layer has been changed."
                },
                {
                  "title": "5456",
                  "note": "PAStore Engine applied Active Directory storage IPsec policy on the computer."
                },
                {
                  "title": "5457",
                  "note": "PAStore Engine failed to apply Active Directory storage IPsec policy on the computer."
                },
                {
                  "title": "5458",
                  "note": "PAStore Engine applied locally cached copy of Active Directory storage IPsec policy on the computer."
                },
                {
                  "title": "5459",
                  "note": "PAStore Engine failed to apply locally cached copy of Active Directory storage IPsec policy on the computer."
                },
                {
                  "title": "5460",
                  "note": "PAStore Engine applied local registry storage IPsec policy on the computer."
                },
                {
                  "title": "5461",
                  "note": "PAStore Engine failed to apply local registry storage IPsec policy on the computer."
                },
                {
                  "title": "5462",
                  "note": "PAStore Engine failed to apply some rules of the active IPsec policy on the computer. Use the IP Security Monitor snap-in to diagnose the problem."
                },
                {
                  "title": "5463",
                  "note": "PAStore Engine polled for changes to the active IPsec policy and detected no changes."
                },
                {
                  "title": "5464",
                  "note": "PAStore Engine polled for changes to the active IPsec policy, detected changes, and applied them to IPsec Services."
                },
                {
                  "title": "5465",
                  "note": "PAStore Engine received a control for forced reloading of IPsec policy and processed the control successfully."
                },
                {
                  "title": "5466",
                  "note": "PAStore Engine polled for changes to the Active Directory IPsec policy, determined that Active Directory cannot be reached, and will use the cached copy of the Active Directory IPsec policy instead. Any changes made to the Active Directory IPsec policy since the last poll could not be applied."
                },
                {
                  "title": "5467",
                  "note": "PAStore Engine polled for changes to the Active Directory IPsec policy, determined that Active Directory can be reached, and found no changes to the policy. The cached copy of the Active Directory IPsec policy is no longer being used."
                },
                {
                  "title": "5468",
                  "note": "PAStore Engine polled for changes to the Active Directory IPsec policy, determined that Active Directory can be reached, found changes to the policy, and applied those changes. The cached copy of the Active Directory IPsec policy is no longer being used."
                },
                {
                  "title": "5471",
                  "note": "PAStore Engine loaded local storage IPsec policy on the computer."
                },
                {
                  "title": "5472",
                  "note": "PAStore Engine failed to load local storage IPsec policy on the computer."
                },
                {
                  "title": "5473",
                  "note": "PAStore Engine loaded directory storage IPsec policy on the computer."
                },
                {
                  "title": "5474",
                  "note": "PAStore Engine failed to load directory storage IPsec policy on the computer."
                },
                {
                  "title": "5477",
                  "note": "PAStore Engine failed to add quick mode filter."
                }
              ]
            },
            {
              "title": "Audit MPSSVC Rule-Level Policy Change",
              "note": "This policy setting allows you to audit events generated by changes in policy rules used by the Microsoft Protection Service (MPSSVC). This service is used by Windows Firewall. Events include the following:\n\tReporting of active policies when Windows Firewall service starts.\n\tChanges to Windows Firewall rules.\n\tChanges to Windows Firewall exception list.\n\tChanges to Windows Firewall settings.\n\tRules ignored or not applied by Windows Firewall Service.\n\tChanges to Windows Firewall Group Policy settings.\n\nIf you configure this policy setting, an audit event is generated by attempts to change policy rules used by the MPSSVC. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated by changes in policy rules used by the MPSSVC.\n\nVolume: Low.\n\nDefault: No Auditing.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-green"
              ],
              "topics": [
                {
                  "title": "4944",
                  "note": "The following policy was active when the Windows Firewall started."
                },
                {
                  "title": "4945",
                  "note": "A rule was listed when the Windows Firewall started."
                },
                {
                  "title": "4946",
                  "note": "A change has been made to Windows Firewall exception list. A rule was added."
                },
                {
                  "title": "4947",
                  "note": "A change has been made to Windows Firewall exception list. A rule was modified."
                },
                {
                  "title": "4948",
                  "note": "A change has been made to Windows Firewall exception list. A rule was deleted."
                },
                {
                  "title": "4949",
                  "note": "Windows Firewall settings were restored to the default values."
                },
                {
                  "title": "4950",
                  "note": "A Windows Firewall setting has changed."
                },
                {
                  "title": "4951",
                  "note": "A rule has been ignored because its major version number was not recognized by Windows Firewall."
                },
                {
                  "title": "4952",
                  "note": "Parts of a rule have been ignored because its minor version number was not recognized by Windows Firewall. The other parts of the rule will be enforced."
                },
                {
                  "title": "4953",
                  "note": "A rule has been ignored by Windows Firewall because it could not parse the rule."
                },
                {
                  "title": "4954",
                  "note": "Windows Firewall Group Policy settings have changed. The new settings have been applied."
                },
                {
                  "title": "4956",
                  "note": "Windows Firewall has changed the active profile."
                },
                {
                  "title": "4957",
                  "note": "Windows Firewall did not apply the following rule."
                },
                {
                  "title": "4958",
                  "note": "Windows Firewall did not apply the following rule because the rule referred to items not configured on this computer."
                }
              ]
            },
            {
              "title": "Audit Other Policy Change Events",
              "note": "This policy setting allows you to audit events generated by other security policy changes that are not audited in the policy change category, such as the following:\n\tTrusted Platform Module (TPM) configuration changes.\n\tKernel-mode cryptographic self tests.\n\tCryptographic provider operations.\n\tCryptographic context operations or modifications.\n\tApplied Central Access Policies (CAPs) changes.\n\tBoot Configuration Data (BCD) modifications.\n\nVolume: Low.\n\nDefault: No Auditing.",
              "makers": [
                "tag-green"
              ],
              "topics": [
                {
                  "title": "4714",
                  "note": "Encrypted data recovery policy was changed."
                },
                {
                  "title": "4819",
                  "note": "Central Access Policies on the machine have been changed."
                },
                {
                  "title": "4826",
                  "note": "Boot Configuration Data loaded."
                },
                {
                  "title": "4909",
                  "note": "The local policy settings for the TBS were changed."
                },
                {
                  "title": "4910",
                  "note": "The group policy settings for the TBS were changed."
                },
                {
                  "title": "5063",
                  "note": "A cryptographic provider operation was attempted."
                },
                {
                  "title": "5064",
                  "note": "A cryptographic context operation was attempted."
                },
                {
                  "title": "5065",
                  "note": "A cryptographic context modification was attempted."
                },
                {
                  "title": "5066",
                  "note": "A cryptographic function operation was attempted."
                },
                {
                  "title": "5067",
                  "note": "A cryptographic function modification was attempted."
                },
                {
                  "title": "5068",
                  "note": "A cryptographic function provider operation was attempted."
                },
                {
                  "title": "5069",
                  "note": "A cryptographic function property operation was attempted."
                },
                {
                  "title": "5070",
                  "note": "A cryptographic function property modification was attempted."
                },
                {
                  "title": "5447",
                  "note": "A Windows Filtering Platform filter has been changed."
                },
                {
                  "title": "6144",
                  "note": "Security policy in the group policy objects has been applied successfully."
                },
                {
                  "title": "6145",
                  "note": "One or more errors occurred while processing security policy in the group policy objects."
                }
              ]
            }
          ]
        },
        {
          "title": "Privilege Use",
          "topics": [
            {
              "title": "Audit Non Sensitive Privilege Use",
              "note": "This policy setting allows you to audit events generated by the use of non-sensitive privileges (user rights).\nThe following privileges are non-sensitive:\n\t\tAccess Credential Manager as a trusted caller.\n\t\tAccess this computer from the network.\n\t\tAdd workstations to domain.\n\t\tAdjust memory quotas for a process.\n\t\tAllow log on locally.\n\t\tAllow log on through Terminal Services.\n\t\tBypass traverse checking.\n\t\tChange the system time.\n\t\tCreate a pagefile.\n\t\tCreate global objects.\n\t\t\n\t\tCreate permanent shared objects.\n\t\tCreate symbolic links.\n\t\tDeny access this computer from the network.\n\t\tDeny log on as a batch job.\n\t\tDeny log on as a service.\n\t\tDeny log on locally.\n\t\tDeny log on through Terminal Services.\n\t\tForce shutdown from a remote system.\n\t\tIncrease a process working set.\n\t\tIncrease scheduling priority.\n\t\tLock pages in memory.\n\t\tLog on as a batch job.\n\t\tLog on as a service.\n\t\tModify an object label.\n\t\tPerform volume maintenance tasks.\n\t\tProfile single process.\n\t\tProfile system performance.\n\t\tRemove computer from docking station.\n\t\tShut down the system.\n\t\tSynchronize directory service data.\n\nIf you configure this policy setting, an audit event is generated when a non-sensitive privilege is called. Success audits record successful calls and Failure audits record unsuccessful calls.\nIf you do not configure this policy setting, no audit event is generated when a non-sensitive privilege is called.\n\nVolume: Very High.",
              "makers": [
                "tag-red"
              ],
              "topics": [
                {
                  "title": "4673",
                  "note": "A privileged service was called."
                },
                {
                  "title": "4674",
                  "note": "An operation was attempted on a privileged object."
                },
                {
                  "title": "4985",
                  "note": "The state of a transaction has changed."
                }
              ]
            },
            {
              "title": "Audit Sensitive Privilege Use",
              "note": "This policy setting allows you to audit events generated when sensitive privileges (user rights) are used such as the following:\n\tA privileged service is called.\n\tOne of the following privileges are called:\n\t\tAct as part of the operating system.\n\t\tBack up files and directories.\n\t\tCreate a token object.\n\t\tDebug programs.\n\t\tEnable computer and user accounts to be trusted for delegation.\n\t\tGenerate security audits.\n\t\tImpersonate a client after authentication.\n\t\tLoad and unload device drivers.\n\t\tManage auditing and security log.\n\t\tModify firmware environment values.\n\t\tReplace a process-level token.\n\t\tRestore files and directories.\n\t\tTake ownership of files or other objects.\n\nIf you configure this policy setting, an audit event is generated when sensitive privilege requests are made. Success audits record successful requests and Failure audits record unsuccessful requests.\nIf you do not configure this policy setting, no audit event is generated when sensitive privilege requests are made.\n\nVolume: High.",
              "makers": [
                "tag-red"
              ],
              "topics": [
                {
                  "title": "4673",
                  "note": "A privileged service was called."
                },
                {
                  "title": "4674",
                  "note": "An operation was attempted on a privileged object."
                },
                {
                  "title": "4985",
                  "note": "The state of a transaction has changed."
                }
              ]
            },
            {
              "title": "Audit Other Privilege Use Events",
              "note": "This auditing subcategory should not have any events in it, but for some reason Success auditing will enable the generation of event 4985(S): The state of a transaction has changed.\n\nRecommended by the ANSSI.",
              "makers": [
                "star-red",
                "symbol-question"
              ],
              "topics": [
                {
                  "title": "4985",
                  "note": "The state of a transaction has changed."
                }
              ]
            }
          ]
        },
        {
          "title": "System",
          "topics": [
            {
              "title": "Audit IPsec Driver",
              "note": "This policy setting allows you to audit events generated by the IPsec filter driver such as the following:\n\tStartup and shutdown of the IPsec services.\n\tNetwork packets dropped due to integrity check failure.\n\tNetwork packets dropped due to replay check failure.\n\tNetwork packets dropped due to being in plaintext.\n\tNetwork packets received with incorrect Security Parameter Index (SPI). This may indicate that either the network card is not working correctly or the driver needs to be updated.\n\tInability to process IPsec filters.\n\nIf you configure this policy setting, an audit event is generated on an IPsec filter driver operation. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated on an IPSec filter driver operation.\n\nVolume: Low.\n\nDefault: No Auditing.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4960",
                  "note": "IPsec dropped an inbound packet that failed an integrity check. If this problem persists, it could indicate a network issue or that packets are being modified in transit to this computer. Verify that the packets sent from the remote computer are the same as those received by this computer. This error might also indicate interoperability problems with other IPsec implementations."
                },
                {
                  "title": "4961",
                  "note": "IPsec dropped an inbound packet that failed a replay check. If this problem persists, it could indicate a replay attack against this computer."
                },
                {
                  "title": "4962",
                  "note": "IPsec dropped an inbound packet that failed a replay check. The inbound packet had too low a sequence number to ensure it was not a replay."
                },
                {
                  "title": "4963",
                  "note": "IPsec dropped an inbound clear text packet that should have been secured. This is usually due to the remote computer changing its IPsec policy without informing this computer. This could also be a spoofing attack attempt."
                },
                {
                  "title": "4965",
                  "note": "IPsec received a packet from a remote computer with an incorrect Security Parameter Index (SPI). This is usually caused by malfunctioning hardware that is corrupting packets. If these errors persist, verify that the packets sent from the remote computer are the same as those received by this computer. This error may also indicate interoperability problems with other IPsec implementations. In that case, if connectivity is not impeded, then these events can be ignored."
                },
                {
                  "title": "5478",
                  "note": "IPsec Services has started successfully."
                },
                {
                  "title": "5479",
                  "note": "IPsec Services has been shut down successfully. The shutdown of IPsec Services can put the computer at greater risk of network attack or expose the computer to potential security risks."
                },
                {
                  "title": "5480",
                  "note": "IPsec Services failed to get the complete list of network interfaces on the computer. This poses a potential security risk because some of the network interfaces may not get the protection provided by the applied IPsec filters. Use the IP Security Monitor snap-in to diagnose the problem."
                },
                {
                  "title": "5483",
                  "note": "IPsec Services failed to initialize RPC server. IPsec Services could not be started."
                },
                {
                  "title": "5484",
                  "note": "IPsec Services has experienced a critical failure and has been shut down. The shutdown of IPsec Services can put the computer at greater risk of network attack or expose the computer to potential security risks."
                },
                {
                  "title": "5485",
                  "note": "IPsec Services failed to process some IPsec filters on a plug-and-play event for network interfaces. This poses a potential security risk because some of the network interfaces may not get the protection provided by the applied IPsec filters. Use the IP Security Monitor snap-in to diagnose the problem."
                }
              ]
            },
            {
              "title": "Audit Other System Events",
              "note": "This policy setting allows you to audit any of the following events:\n\tStartup and shutdown of the Windows Firewall service and driver.\n\tSecurity policy processing by the Windows Firewall Service.\n\tCryptography key file and migration operations.\n\nVolume: Low.\n\nDefault: Success, Failure.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "5024",
                  "note": "The Windows Firewall Service has started successfully."
                },
                {
                  "title": "5025",
                  "note": "The Windows Firewall Service has been stopped."
                },
                {
                  "title": "5027",
                  "note": "The Windows Firewall Service was unable to retrieve the security policy from the local storage. The service will continue enforcing the current policy."
                },
                {
                  "title": "5028",
                  "note": "The Windows Firewall Service was unable to parse the new security policy. The service will continue with currently enforced policy."
                },
                {
                  "title": "5029",
                  "note": "The Windows Firewall Service failed to initialize the driver. The service will continue to enforce the current policy."
                },
                {
                  "title": "5030",
                  "note": "The Windows Firewall Service failed to start."
                },
                {
                  "title": "5032",
                  "note": "Windows Firewall was unable to notify the user that it blocked an application from accepting incoming connections on the network."
                },
                {
                  "title": "5033",
                  "note": "The Windows Firewall Driver has started successfully."
                },
                {
                  "title": "5034",
                  "note": "The Windows Firewall Driver has been stopped."
                },
                {
                  "title": "5035",
                  "note": "The Windows Firewall Driver failed to start."
                },
                {
                  "title": "5037",
                  "note": "The Windows Firewall Driver detected critical runtime error. Terminating."
                },
                {
                  "title": "5058",
                  "note": "Key file operation."
                },
                {
                  "title": "5059",
                  "note": "Key migration operation."
                },
                {
                  "title": "6400",
                  "note": "BranchCache: Received an incorrectly formatted response while discovering availability of content.\n\nThis event is logged only on computers running supported versions of the Windows operating system."
                },
                {
                  "title": "6401",
                  "note": "BranchCache: Received invalid data from a peer. Data discarded.\n\nThis event is logged only on computers running supported versions of the Windows operating system."
                },
                {
                  "title": "6402",
                  "note": "BranchCache: The message to the hosted cache offering it data is incorrectly formatted.\n\nThis event is logged only on computers running supported versions of the Windows operating system."
                },
                {
                  "title": "6403",
                  "note": "BranchCache: The hosted cache sent an incorrectly formatted response to the client.\n\nThis event is logged only on computers running supported versions of the Windows operating system."
                },
                {
                  "title": "6404",
                  "note": "BranchCache: Hosted cache could not be authenticated using the provisioned SSL certificate.\n\nThis event is logged only on computers running supported versions of the Windows operating system."
                },
                {
                  "title": "6405",
                  "note": "BranchCache: %2 instance(s) of event id %1 occurred. (Undocumented)\n\nThis event is logged only on computers running supported versions of the Windows operating system."
                },
                {
                  "title": "6406",
                  "note": "%1 registered to Windows Firewall to control filtering for the following: %2 (Undocumented)\n\nThis event is logged only on computers running supported versions of the Windows operating system."
                },
                {
                  "title": "6407",
                  "note": "Undocumented\n\nThis event is logged only on computers running supported versions of the Windows operating system."
                },
                {
                  "title": "6408",
                  "note": "Registered product %1 failed and Windows Firewall is now controlling the filtering for %2 (Undocumented)\n\nThis event is logged only on computers running supported versions of the Windows operating system."
                },
                {
                  "title": "6409",
                  "note": "BranchCache: A service connection point object could not be parsed."
                }
              ]
            },
            {
              "title": "Audit Security State Change",
              "note": "This policy setting allows you to audit events generated by changes in the security state of the computer such as the following events:\n\tStartup and shutdown of the computer.\n\tChange of system time.\n\tRecovering the system from CrashOnAuditFail, which is logged after a system restarts when the security event log is full and the CrashOnAuditFail registry entry is configured.\n\nVolume: Low.\n\nDefault: Success.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-orange"
              ],
              "topics": [
                {
                  "title": "4608",
                  "note": "Windows is starting up."
                },
                {
                  "title": "4616",
                  "note": "The system time was changed."
                },
                {
                  "title": "4621",
                  "note": "Administrator recovered system from CrashOnAuditFail. Users who are not administrators will now be allowed to log on. Some auditable activity might not have been recorded."
                }
              ]
            },
            {
              "title": "Audit Security System Extension",
              "note": "This policy setting allows you to audit events related to security system extensions or services such as the following:\n\tA security system extension, such as an authentication, notification, or security package is loaded and is registered with the Local Security Authority (LSA). It is used to authenticate logon attempts, submit logon requests, and any account or password changes. Examples of security system extensions are Kerberos and NTLM.\n\tA service is installed and registered with the Service Control Manager. The audit log contains information about the service name, binary, type, start type, and service account.\nIf you configure this policy setting, an audit event is generated when an attempt is made to load a security system extension. Success audits record successful attempts and Failure audits record unsuccessful attempts.\nIf you do not configure this policy setting, no audit event is generated when an attempt is made to load a security system extension.\n\nVolume: Low. Security system extension events are generated more often on a domain controller than on client computers or member servers.\n\nDefault: No Auditing.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4610",
                  "note": "An authentication package has been loaded by the Local Security Authority."
                },
                {
                  "title": "4611",
                  "note": "A trusted logon process has been registered with the Local Security Authority."
                },
                {
                  "title": "4614",
                  "note": "A notification package has been loaded by the Security Account Manager."
                },
                {
                  "title": "4622",
                  "note": "A security package has been loaded by the Local Security Authority."
                },
                {
                  "title": "4697",
                  "note": "A service was installed in the system."
                }
              ]
            },
            {
              "title": "Audit System Integrity",
              "note": "This policy setting allows you to audit events that violate the integrity of the security subsystem, such as the following:\n\tEvents that could not be written to the event log because of a problem with the auditing system.\n\tA process that uses a local procedure call (LPC) port that is not valid in an attempt to impersonate a client by replying, reading, or writing to or from a client address space.\n\tThe detection of a Remote Procedure Call (RPC) that compromises system integrity.\n\tThe detection of a hash value of an executable file that is not valid as determined by Code Integrity.\n\tCryptographic operations that compromise system integrity.\n\nVolume: Low.\n\nDefault: Success, Failure.\n\nRecommended by the ANSSI.",
              "makers": [
                "tag-green",
                "star-red"
              ],
              "topics": [
                {
                  "title": "4612",
                  "note": "Internal resources allocated for the queuing of audit messages have been exhausted, leading to the loss of some audits."
                },
                {
                  "title": "4615",
                  "note": "Invalid use of LPC port."
                },
                {
                  "title": "4618",
                  "note": "A monitored security event pattern has occurred."
                },
                {
                  "title": "4816",
                  "note": "RPC detected an integrity violation while decrypting an incoming message."
                },
                {
                  "title": "5038",
                  "note": "Code integrity determined that the image hash of a file is not valid. The file could be corrupt due to unauthorized modification or the invalid hash could indicate a potential disk device error."
                },
                {
                  "title": "5056",
                  "note": "A cryptographic self-test was performed."
                },
                {
                  "title": "5057",
                  "note": "A cryptographic primitive operation failed."
                },
                {
                  "title": "5060",
                  "note": "Verification operation failed."
                },
                {
                  "title": "5061",
                  "note": "Cryptographic operation."
                },
                {
                  "title": "5062",
                  "note": "A kernel-mode cryptographic self-test was performed."
                },
                {
                  "title": "6281",
                  "note": "Code Integrity determined that the page hashes of an image file are not valid. The file could be improperly signed without page hashes or corrupt due to unauthorized modification. The invalid hashes could indicate a potential disk device error.\n\nThis event is logged only on computers running the supported versions of the Windows operating system."
                },
                {
                  "title": "6410",
                  "note": "Code integrity determined that a file does not meet the security requirements to load into a process."
                }
              ]
            }
          ]
        },
        {
          "title": "Global Object Access Auditing",
          "topics": [
            {
              "title": "File system",
              "note": "This policy setting allows you to apply a comprehensive object access audit policy to every file and folder on the file system for a computer. Configuring this setting also allows you to demonstrate that every file and folder on the computer is monitored by an audit policy that is managed from a central location.\n\nThis setting applies a global system access control list (SACL) to every file and folder. If both a file or folder SACL and a global SACL are configured on a computer, the effective SACL is derived by combining the file or folder SACL and the global SACL. This means that an audit event is generated when an activity matches either the file or folder SACL or the global SACL.\n\nTo configure a global object access policy, you must select Define this policy setting and click Configure to add at least one user or group to the global SACL. You must also enable the Audit File System setting under Advanced Audit Policy Configuration\\System Audit Policies\\Object Access.\n\nVolume: Depends on the effective SACL and the level of user activity.",
              "makers": [
                "symbol-question"
              ]
            },
            {
              "title": "Registry",
              "note": "This policy setting allows you to apply a global object access audit policy to the registry for an entire computer. This policy setting allows you to demonstrate that every registry object on the computer is protected by an audit policy that is managed from a central location.\n\nThis setting applies a global system access control list (SACL) to every registry object. If both a registry SACL and a global SACL are configured on a computer, the effective SACL is derived by combining the registry SACL and the global SACL. This means that an audit event is generated when an activity matches either the registry key SACL or the global SACL.\n\nTo configure a global object access policy, you must select Define this policy setting and click Configure to add at least one user or group to the global SACL. You must also enable the Audit Registry setting under Advanced Audit Policy Configuration\\System Audit Policies\\Object Access.\n\nVolume: Depends on the effective SACL and the level of user activity.",
              "makers": [
                "symbol-question"
              ]
            }
          ]
        }
      ]
    },
    "structure": "org.xmind.ui.logic.right"
  }
]